---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
source: html/41827baa-8f7f-c049-4c4c-780b15ac6c08.htm
---
# StructuralSectionRectangleParameterized Methods

Returns size of the section boundary.